sdaiDeleteModel(Sdai_instS*)
\details
Deletes a specified model.
\param model [in] A model to be deleted.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NEXS - Transaction does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "ModelName", "ifc4");
...
sdaiDeleteModel(model);